# Combine and Merging Datasets

data contained can be combined together in a number of ways

## Database-Style Dataframe joins


The same key data are bound.
Look at the example

In [1]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

```python
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df1
```

In [2]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

```python
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2
```

In [3]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

To merge two Dataframe with the same index 
```python
pd.merge(df1,df2)
```

In [4]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Without setting anything. The key will used from the columns which is the same name in both data frame. The values which are the same in both data are provided, and the Cartesian products of the other values are provided as the data.

It should be better if we specified the key name

```python
pd.merge(df1,df2,on='key')
```

In [5]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

we can merge on the different column name

```python
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
```

In [6]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

### Work
Form the given /file/studentlist.xlsx
It is the Excel which provide the score of the students.
Create the data frame which consist of the total score of Attendance(Midterm) score,and midterm score
-> to get the new dataframe from the old dataframe column you may use this code
` new = old[['A', 'C', 'D']].copy() `
to change the specific column name you may use
` rankings_pd.rename(columns = {'test':'TEST'}, inplace = True)`
note: you do not have to set the student id column to be the index in this work

In [7]:
import pandas as pd

file_path = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/08. Data Wrangling/files/studentlist.xlsx'
student_df = pd.read_excel(file_path)

student_df.head()

,รายชื่อนักศึกษาที่ลงทะเบียนเรียน ภาคเรียนที่ 1 ปีการศึกษา 2562,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,COURSE NO :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,TITLE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,SECTION (lec/lab) :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,LECTURE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DATE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
student_df.iloc[5:30]

,รายชื่อนักศึกษาที่ลงทะเบียนเรียน ภาคเรียนที่ 1 ปีการศึกษา 2562,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
5,ที่,รหัสนักศึกษา,2.0,3.0,4.0,5.0,6.0,7.0,Total (5)
6,1,582115509,5.0,5.0,5.0,5.0,5.0,5.0,2.5
7,2,592115508,5.0,5.0,5.0,5.0,5.0,5.0,2.5
8,3,592115521,5.0,5.0,5.0,5.0,5.0,5.0,2.5
9,4,602115001,0.0,0.0,0.0,0.0,0.0,0.0,0
...,...,...,...,...,...,...,...,...,...
25,20,602115503,9.0,5.0,8.0,6.0,7.0,6.0,3.416667
26,21,602115504,0.0,0.0,0.0,0.0,8.0,8.0,1.333333
27,22,602115505,0.0,5.0,5.0,7.0,6.0,7.0,2.5
28,23,602115507,0.0,7.0,8.0,7.0,7.0,0.0,2.416667
29,24,602115508,7.0,6.0,6.0,6.0,0.0,7.0,2.666667

In [9]:
student_data = pd.read_excel(file_path, skiprows=5)
student_data.head()

,DATE :,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,ที่,รหัสนักศึกษา,2,3,4,5,6,7,Total (5)
1,1,582115509,5,5,5,5,5,5,2.5
2,2,592115508,5,5,5,5,5,5,2.5
3,3,592115521,5,5,5,5,5,5,2.5
4,4,602115001,0,0,0,0,0,0,0

In [10]:
student_data.columns = [
    'No', 'Student ID',
    'Activity 1', 'Activity 2', 'Activity 3', 'Activity 4', 'Activity 5', 'Activity 6',
    'Midterm Score'
]

student_data_cleaned = student_data.drop(0).reset_index(drop=True)

student_data_cleaned.head()

,No,Student ID,Activity 1,Activity 2,Activity 3,Activity 4,Activity 5,Activity 6,Midterm Score
0,1,582115509,5,5,5,5,5,5,2.5
1,2,592115508,5,5,5,5,5,5,2.5
2,3,592115521,5,5,5,5,5,5,2.5
3,4,602115001,0,0,0,0,0,0,0
4,5,602115002,9,8,7,9,7,8,4

In [73]:
new_df = student_data_cleaned[['Student ID', 'Activity 1', 'Midterm Score']]

In [75]:
new_df.head()

  Student ID  Activity 1 Midterm Score
0  582115509           5           2.5
1  592115508           5           2.5
2  592115521           5           2.5
3  602115001           0             0
4  602115002           9             4

Check df3 and df4
```python
df3
```

In [16]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

```python
df4
```

In [17]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

then try to merge df3 and df4
```python
pd.merge(df3,df4)
```

In [18]:
pd.merge(df3,df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

You may see that it's could not merge as there is no column which are the same key name.
We can specify the column name which can be merge using the different name with the `left-on` and `right_on` argument
```python
pd.merge(df3, df4, left_on='lkey', right_on='rkey')
```

In [19]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

or 
```python
pd.merge(df4, df3,  right_on='lkey',left_on='rkey')
```

In [20]:
pd.merge(df4, df3,  right_on='lkey',left_on='rkey')

  rkey  data2 lkey  data1
0    a      0    a      2
1    a      0    a      4
2    a      0    a      5
3    b      1    b      0
4    b      1    b      1
5    b      1    b      6

You may see that c, and d is removed as it's not in the left data frame

To use all data we use the outer argument
```python
pd.merge(df1,df2,how='outer')
```

In [21]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

You may try other argument to see the different
![image-20230915053652812](./assets/image-20230915053652812.png)

inner join is the intersection of the data
```python
pd.merge(df1,df2,how='inner')
```

In [22]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

left join is the left data frame
```python
pd.merge(df1,df2,how='left')
```

In [23]:
pd.merge(df1,df2,how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

we can merge with multiple keys by passing a list of columns
try to create this given data frame
```python
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
```

In [24]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

then try to merge with the multiple keys
```python
pd.merge(left,right,on=['key1','key2'],how='outer')
```

In [25]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

Some time if the name of the column may be collapse. (Same column name, but not the key)
You may change the name of the column before merging directly, or you can set the suffix column
the example of the problem is shown
```python
pd.merge(left, right, on='key1')
```

In [26]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

the suffixes can be set by the `suffixes` argument
```python
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))
```

In [27]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Work
The students have been withdrawn so they do not have the score, in addition the staff change some of the index name.
So please try to add the attendance midterm score to the previous pandas

In [76]:
new_df['Midterm Score'] = pd.to_numeric(new_df['Midterm Score'], errors='coerce')
new_df['Total Score'] = new_df['Activity 1'] + new_df['Midterm Score']

new_df.head()

C:\Users\Dell\AppData\Local\Temp\ipykernel_13376\3665669708.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Midterm Score'] = pd.to_numeric(new_df['Midterm Score'], errors='coerce')
C:\Users\Dell\AppData\Local\Temp\ipykernel_13376\3665669708.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Total Score'] = new_df['Activity 1'] + new_df['Midterm Score']

  Student ID  Activity 1  Midterm Score  Total Score
0  582115509           5            2.5          7.5
1  592115508           5            2.5          7.5
2  592115521           5            2.5          7.5
3  602115001           0            0.0          0.0
4  602115002           9            4.0         13.0

## Merging by index

Some time you may found that the part you want to merge is the index.
You can set the `left_index=True` or `right_index=True` to indicate that you need to use the index as the merge key

try this source code
```python
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
```

In [31]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

then try to merge with the index
```python
pd.merge(left1, right1, left_on='key', right_index=True)
```

In [32]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

the how can be applied as the same as the normal merge
```python
pd.merge(left1, right1, left_on='key', right_index=True,how ='outer')
```

In [33]:
pd.merge(left1, right1, left_on='key', right_index=True,how ='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

With hierarchically index, joining on index can be used as multiple-key merge
```python
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                        index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                                'Ohio', 'Ohio'],
                                 [2001, 2000, 2000, 2000, 2001, 2002]],
                        columns=['event1', 'event2'])
 ```

In [34]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                        index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                                'Ohio', 'Ohio'],
                                 [2001, 2000, 2000, 2000, 2001, 2002]],
                        columns=['event1', 'event2'])

The merge with multiple column can be set with the column, and the key index
```python
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)
```

In [35]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

with the `outer` join all data will be merged
```python
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')
```

In [36]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

### Work
now setting the index to the Dataframe which we have done so far.
then add the rest of the score so that we can handle the overall score with in Dataframe

In [78]:
new_df.head()

            Activity 1  Midterm Score  Total Score
Student ID
582115509            5            2.5          7.5
592115508            5            2.5          7.5
592115521            5            2.5          7.5
602115001            0            0.0          0.0
602115002            9            4.0         13.0

In [79]:
student_data_cleaned.set_index('Student ID', inplace=True)

activity_columns = ['Activity 1', 'Activity 2', 'Activity 3', 'Activity 4', 'Activity 5', 'Activity 6', 'Midterm Score']
student_data_cleaned[activity_columns] = student_data_cleaned[activity_columns].apply(pd.to_numeric, errors='coerce')


student_data_cleaned['Total Score'] = student_data_cleaned[activity_columns].sum(axis=1)


student_data_cleaned.head()

,No,Activity 1,Activity 2,Activity 3,Activity 4,Activity 5,Activity 6,Midterm Score,Total Score
Student ID,,,,,,,,,
582115509,1,5,5,5,5,5,5,2.5,32.5
592115508,2,5,5,5,5,5,5,2.5,32.5
592115521,3,5,5,5,5,5,5,2.5,32.5
602115001,4,0,0,0,0,0,0,0.0,0.0
602115002,5,9,8,7,9,7,8,4.0,52.0

Now find the name of the students whose name is in the top 10 of the total score.

## Concatenating Along an Axis

Concatenating data is to concat data to the same data.

An Axis mean concat the column data

In NumPy concatenate data concate it in each columns as shown in example

```python
arr = np.arange(12).reshape((3, 4))
arr
```

In [37]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

We can concat the arrays by using the `np.concatenate` function
```python
np.concatenate([arr, arr])
```

In [38]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

we can concatenate the array in the different axis by passing the axis argument
```python
np.concatenate([arr, arr], axis=1)
```

In [39]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In Pandas, there are many concerns before concatination

* If the objects are indexed differently on the other axes, should we combine the distinct elements in these axes or use only the shared values (the intersection)?
* Do the concatenated chunks of data need to be identifiable in the resulting object?
* Does the “concatenation axis” contain data that needs to be preserved? In many cases, the default integer labels in a DataFrame are best discarded during concatenation.

try creating a series

```python
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
```

In [40]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

Then try the simple concat
```python
pd.concat([s1, s2, s3])
```

In [41]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

and then concat on Axis
```python
pd.concat([s1, s2, s3], axis=1)
```

In [42]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

You may name each of the columns by the key column
```python
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])
```

In [43]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

You may notice that each series are concat as a new column.

This we can say as the union case as the data that combined all data (and NaN has been added to complete the data series)

To intersect them, you may passing `join='inner'`

see the following example
```python
s4 = pd.concat([s1, s3])
s4
```

In [44]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

if we concat in the different axis
```python
pd.concat([s1, s4], axis=1)
```

In [45]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

then try the inner join
```python
pd.concat([s1, s4], axis=1, join='inner')
```

In [46]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

we can provide the hierarchical index of the search as given
```python
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result
```

In [47]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

we also use the unstack() to show all data
```python
result.unstack()
```

In [48]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

### Work
It's happen that there are other sections score in the class. The files/studentlist2.xlsx provide the score for the second section. merge the data from two file to only one dataframe to find out the descriptive statistic of all the students.

In [80]:
file_path_2 = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/08. Data Wrangling/files/studentlist2.xlsx'
student_data_2 = pd.read_excel(file_path_2, skiprows=5)

student_data_2.head()

,DATE :,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,ที่,รหัสนักศึกษา,2,3,4,5,6,7,Total (5)
1,1,612115509,5,5,5,5,5,5,2
2,2,612115508,5,5,5,5,5,5,2

In [81]:
student_data_2.columns = [
    'No', 'Student ID',
    'Activity 1', 'Activity 2', 'Activity 3', 'Activity 4', 'Activity 5', 'Activity 6',
    'Midterm Score'
]

student_data_2_cleaned = student_data_2.drop(0).reset_index(drop=True)

student_data_2_cleaned.set_index('Student ID', inplace=True)

activity_columns_2 = ['Activity 1', 'Activity 2', 'Activity 3', 'Activity 4', 'Activity 5', 'Activity 6', 'Midterm Score']
student_data_2_cleaned[activity_columns_2] = student_data_2_cleaned[activity_columns_2].apply(pd.to_numeric, errors='coerce')

student_data_2_cleaned['Total Score'] = student_data_2_cleaned[activity_columns_2].sum(axis=1)

student_data_2_cleaned.head()

,No,Activity 1,Activity 2,Activity 3,Activity 4,Activity 5,Activity 6,Midterm Score,Total Score
Student ID,,,,,,,,,
612115509,1,5,5,5,5,5,5,2,32
612115508,2,5,5,5,5,5,5,2,32

In [82]:
merged_df = pd.concat([student_data_cleaned, student_data_2_cleaned], axis=0)

merged_df.head()

,No,Activity 1,Activity 2,Activity 3,Activity 4,Activity 5,Activity 6,Midterm Score,Total Score
Student ID,,,,,,,,,
582115509,1,5,5,5,5,5,5,2.5,32.5
592115508,2,5,5,5,5,5,5,2.5,32.5
592115521,3,5,5,5,5,5,5,2.5,32.5
602115001,4,0,0,0,0,0,0,0.0,0.0
602115002,5,9,8,7,9,7,8,4.0,52.0

In [83]:
descriptive_statistics = merged_df['Total Score'].describe()
descriptive_statistics

count    37.000000
mean     29.867117
std      13.371941
min       0.000000
25%      20.583333
50%      32.000000
75%      34.666667
max      54.166667
Name: Total Score, dtype: float64

The teacher is very funny, they will random the score for all the students, create a new dataframe which provide the random score from 1 to the maximum score we can get from all students.
then merge the score to the student, and calculate the new score of all the student. then set the grade of the student by who get the grade less than 80 will get `F` otherwise will get `A`

In [84]:
import numpy as np

# 1. Create a new DataFrame with random scores for each student
max_score = merged_df['Total Score'].max()
random_scores_df = pd.DataFrame(index=merged_df.index)
random_scores_df['Random Score'] = np.random.randint(1, max_score + 1, len(random_scores_df))

# Display the new DataFrame with random scores
random_scores_df.head()

            Random Score
Student ID
582115509             35
592115508             38
592115521             30
602115001              2
602115002             37

In [85]:
merged_df_with_random = pd.merge(merged_df, random_scores_df, left_index=True, right_index=True)

merged_df_with_random['New Total Score'] = merged_df_with_random['Total Score'] + merged_df_with_random['Random Score']

merged_df_with_random['Grade'] = np.where(merged_df_with_random['New Total Score'] < 80, 'F', 'A')

merged_df_with_random.head()

,No,Activity 1,Activity 2,Activity 3,Activity 4,Activity 5,Activity 6,Midterm Score,Total Score,Random Score,New Total Score,Grade
Student ID,,,,,,,,,,,,
582115509,1,5,5,5,5,5,5,2.5,32.5,35,67.5,F
592115508,2,5,5,5,5,5,5,2.5,32.5,38,70.5,F
592115521,3,5,5,5,5,5,5,2.5,32.5,30,62.5,F
602115001,4,0,0,0,0,0,0,0.0,0.0,2,2.0,F
602115002,5,9,8,7,9,7,8,4.0,52.0,37,89.0,A

## Combine Data with Overlap



The data con be merse if there are overlap in full or part

In [49]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

Combine the series using the if else expression.
Let's try
```python
np.where(pd.isnull(a),b,a)
```

In [50]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

try vice versa
```python
np.where(pd.isnull(a),a,b)
```

In [51]:
np.where(pd.isnull(a),a,b)

array([nan,  1., nan,  3.,  4., nan])

`combine_first` combine the data the series
```python
b[:-2].combine_first(a[2:])
```

In [52]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

`combine_first` for the Dataframe will do the same thing but with all column by column.

It is similar to *patching* the data (replace the data in `NaN` position.

In [ ]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
 'b': [np.nan, 2., np.nan, 6.],
 'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
 'b': [np.nan, 3., 4., 6., 8.]})
df1

In [53]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
 'b': [np.nan, 2., np.nan, 6.],
 'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
 'b': [np.nan, 3., 4., 6., 8.]})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

try
```python
df1.combine_first(df2)
```

In [54]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

```python
df2.combine_first(df1)
```

In [55]:
df2.combine_first(df1)

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# Reshaping and Pivoting

## Reshaping with Hierachical Indexing

Using the Hierarchical Indexing can reshape data in different way

The operations we can use are



*   `stack` rotate or pivots from the columns in the data to the rows
*   `unstack` privots from the rows into the columns

In [56]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
    index=pd.Index(['Ohio', 'Colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'],
    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

Using the `stack` to pivot the columns into the rows, produce a serie from the data frame

```python
result = data.stack()
result
```

In [57]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

from hierachically indexed Series, we can rearrange into a DataFrame with `unstack`
```python
result.unstack()
```

In [58]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

By the default the innermost level is unstacked, we can unstadck the different level by pasing the level name.
```python
result.unstack('state')
```

In [59]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

unstack may introduce the missing data if all of the value in the level is ont found in each group

In [60]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

try to do unstack
```python
data2.unstack()
```

In [61]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

Stacking filter out the missing data by default, to preseved the na when unstack `dropna=False ` is required
```python
data2.unstack().stack()
```

In [62]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

when using the dropna
```python
data2.unstack().stack(dropna=False)
```

In [63]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

When you unstack in a DataFrame, the **level unstacked** becomes the lowest level in the result
```python
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df
```

In [64]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

try
```python
df.unstack('state')
```

In [65]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

we may use the state to stack the side
```python
df.unstack('state').stack('side')
```

In [66]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# Work

From the three files provided [here](https://github.com/jakevdp/data-USstates/)

1. Bind all data to get the data frame which have the state/ abbreviation, and area(sq.mi)
2. Bind the data to get the State, age, and population
3. Create the multiple hierachy dataframe, which contains the age as sub hierachy. The column should be the year and population, and the year must be order.

1. Bind all data to get the data frame which have the state/ abbreviation, and area(sq.mi)

In [67]:
import pandas as pd

abbrevs_file = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/08. Data Wrangling/files/state-abbrevs.csv'
areas_file = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/08. Data Wrangling/files/state-areas.csv'
population_file = 'C:/Users/Dell/Desktop/LectureNote/LectureNote_660632028/08. Data Wrangling/files/state-population.csv'

state_abbrevs = pd.read_csv(abbrevs_file)
state_areas = pd.read_csv(areas_file)
state_population = pd.read_csv(population_file)

state_abbrevs.head(), state_areas.head(), state_population.head()

(        state abbreviation
 0     Alabama           AL
 1      Alaska           AK
 2     Arizona           AZ
 3    Arkansas           AR
 4  California           CA,
         state  area (sq. mi)
 0     Alabama          52423
 1      Alaska         656425
 2     Arizona         114006
 3    Arkansas          53182
 4  California         163707,
   state/region     ages  year  population
 0           AL  under18  2012   1117489.0
 1           AL    total  2012   4817528.0
 2           AL  under18  2010   1130966.0
 3           AL    total  2010   4785570.0
 4           AL  under18  2011   1125763.0)

In [68]:
combined_df = pd.merge(state_abbrevs, state_areas, on="state")

combined_df.head()

        state abbreviation  area (sq. mi)
0     Alabama           AL          52423
1      Alaska           AK         656425
2     Arizona           AZ         114006
3    Arkansas           AR          53182
4  California           CA         163707

2. Bind the data to get the State, age, and population

In [69]:
population_with_state = pd.merge(state_population, state_abbrevs, left_on="state/region", right_on="abbreviation")

population_data = population_with_state[["state", "ages", "population"]]

population_data.head()

     state     ages  population
0  Alabama  under18   1117489.0
1  Alabama    total   4817528.0
2  Alabama  under18   1130966.0
3  Alabama    total   4785570.0
4  Alabama  under18   1125763.0

3. Create the multiple hierachy dataframe, which contains the age as sub hierachy. The column should be the year and population, and the year must be order.

In [70]:
population_with_state = pd.merge(state_population, state_abbrevs, left_on="state/region", right_on="abbreviation")

population_with_state = population_with_state.drop(columns=["state/region", "abbreviation"])

hierarchy_df = population_with_state.set_index(["state", "ages", "year"]).unstack("year").sort_index(axis=1)

hierarchy_df.head()

                population                                              \
year                  1990       1991       1992       1993       1994
state   ages
Alabama total    4050055.0  4099156.0  4154014.0  4214202.0  4260229.0
        under18  1050041.0  1060794.0  1072873.0  1085606.0  1097180.0
Alaska  total     553290.0   570193.0   588736.0   599434.0   603308.0
        under18   177502.0   182180.0   184878.0   187190.0   187439.0
Arizona total    3684097.0  3788576.0  3915740.0  4065440.0  4245089.0

                                                                        ...  \
year                  1995       1996       1997       1998       1999  ...
state   ages                                                            ...
Alabama total    4296800.0  4331103.0  4367935.0  4404701.0  4430141.0  ...
        under18  1110553.0  1112092.0  1122893.0  1118252.0  1121287.0  ...
Alaska  total     604412.0   608569.0   612968.0   619933.0   624779.0  ...
        under18   184990.0   185360.0   188280.0   192636.0   191422.0  ...
Arizona total    4432499.0  4586940.0  4736990.0  4883342.0  5023823.0  ...

                                                                        \
year                  2004       2005       2006       2007       2008
state   ages
Alabama total    4530729.0  4569805.0  4628981.0  4672840.0  4718206.0
        under18  1113662.0  1117229.0  1126798.0  1132296.0  1134927.0
Alaska  total     659286.0   666946.0   675302.0   680300.0   687455.0
        under18   186335.0   185304.0   185580.0   184344.0   183124.0
Arizona total    5652404.0  5839077.0  6029141.0  6167681.0  6280362.0


year                  2009       2010       2011       2012       2013
state   ages
Alabama total    4757938.0  4785570.0  4801627.0  4817528.0  4833722.0
        under18  1134192.0  1130966.0  1125763.0  1117489.0  1111481.0
Alaska  total     698895.0   713868.0   723375.0   730307.0   735132.0
        under18   186351.0   187902.0   188329.0   188162.0   188132.0
Arizona total    6343154.0  6408790.0  6468796.0  6551149.0  6626624.0

[5 rows x 24 columns]